app/controllers/client_workouts_controller.rb

SELECT * FROM "client_workouts"
---
  def index
    @client_workouts = ClientWorkout.all

SELECT * FROM "client_workouts" WHERE (client_name ='Michael McGuire' OR trainer ='Michael McGuire')
---
  def find
	@client_workouts = ClientWorkout.find(:all,
		:conditions => ["client_name =? OR trainer =?",
		params[:search_string], params[:search_string]])

SELECT * FROM "client_workouts" WHERE ("client_workouts"."id" = 1)
---
  def show
    @client_workout = ClientWorkout.find(params[:id])

SELECT * FROM "client_workouts" WHERE ("client_workouts"."id" = 1)
---
  def edit
    @client_workout = ClientWorkout.find(params[:id])

INSERT INTO "client_workouts" ("created_at", "client_name", "paid_amount", "trainer", "updated_at", "duration_mins", "date_of_workout") VALUES('2010-07-22 21:17:39', 'Michael McGuire', 300.0, 'Helga', '2010-07-22 21:17:39', 90, '2010-07-22')
---
  def create
    @client_workout = ClientWorkout.new(params[:client_workout])

    respond_to do |format|
      if @client_workout.save

SELECT * FROM "client_workouts" WHERE ("client_workouts"."id" = 1)
UPDATE "client_workouts" SET "updated_at" = '2010-07-25 17:47:23', "paid_amount" = 400.0 WHERE "id" = 1
---
  def update
    @client_workout = ClientWorkout.find(params[:id])

    respond_to do |format|
      if @client_workout.update_attributes(params[:client_workout])